0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #include "include/ABLConditions"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
//    inlet
//    {
//        type            fixedValue;
//        value           $internalField;//$flowVelocity; //uniform (0 0 0);
//    }
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        Uref            $Uref;
        Href            $Href;
        n               $windDirection;
        z               $zDirection;
        z0              $z0;
        value           $internalField;
        zGround         $zGround;
    }

///*    "terrain_.*"
//    {
//        type            uniformFixedValue;
//        uniformValue    (0 0 0);
//        value           uniform (0 0 0);
//    } */
//
    lowerWall 
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
        value           uniform (0 0 0);
    } 

//    lowerWall
//    {
//        type            uniformFixedValue;
//        value           uniform (0 0 0);
//        uniformValue    constant (0 0 0);
//    }

//    #include "include/sideAndTopPatches"
    #include "include/sidesAndUpperLowerPatches"
}


// ************************************************************************* //
