0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{
    #include "include/ABLConditions"

//    "terrain_.*"
//    {
//        type            epsilonWallFunction;
//        Cmu             0.09;
//        kappa           0.4;
//        E               9.8;
//        value           $internalField;
//    }

    lowerWall 
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }
//    inlet
//    {
//        type            uniformFixedValue;
//        value           $turbulentEpsilon;
//        uniformValue    constant $turbulentEpsilon;
//    }
//    inlet
//    {
//        type            fixedValue;
//        value           $internalField;//$turbulentEpsilon; 
//    }
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        Uref            $Uref;
        Href            $Href;
        z               $zDirection;
        z0              $z0;
        value           $internalField;
        zGround         $zGround;
    }

//    ground
//    {
//        type            zeroGradient;
//    }

//    #include "include/sideAndTopPatches"
    #include "include/sidesAndUpperLowerPatches"
}


// ************************************************************************* //
