0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 10.0;
Href                 200;
z0                   uniform 0.03;
turbulentKE          0.68792;
windDirection        (1 0 0);
zDirection           (0 0 1);
zGround              uniform 0.0;
// ************************************************************************* //
