0/include/sidesAndUpperLowerPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

//lowerWall
//{
//    type slip;
//}

upperWall
{
    type slip;
}

sides
{
    type symmetryPlane;
}

// ************************************************************************* //
