0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    #include "include/ABLConditions"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           $internalField;
    }
    inlet
    {
        type            uniformFixedValue;
        value           $turbulentKE;
        uniformValue    constant $turbulentKE;
    }
///*    "terrain_.*"
//    {
//        type            kqRWallFunction;
//        value           uniform 0.0;
//    } */

    lowerWall 
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    } 

//    lowerWall 
//    {
//        type            zeroGradient;
//    }
//    upperWall
//    {
//        type            zeroGradient;
//    }

//    #include "include/sidesAndTopPatches"
    #include "include/sidesAndUpperLowerPatches"  
}


// ************************************************************************* //
