0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #include "include/ABLConditions"
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            uniformFixedValue;
        value           $pressure;
        uniformValue    constant $pressure;
    }

//    "terrain_.*"
//    {
//        type            zeroGradient;
//    }
//

    lowerWall 
    {
        type            zeroGradient;
    }

//    ground
//    {
//        type            zeroGradient;
//    }

//    #include "include/sideAndTopPatches"
    #include "include/sidesAndUpperLowerPatches"
}

// ************************************************************************* //
