constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (   0    0    0)
    ( 540    0    0)
    ( 540  216    0)
    (   0  216    0)
    (   0    0  216)
    ( 540    0  216)
    ( 540  216  216)
    (   0  216  216)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 72 72) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    lowerWall 
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type symmetryplane;
        faces
        (
            (1 5 4 0)
            (3 7 6 2) 
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 1 2 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
